zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DIGRF_TOP.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K39_DIGRF_TOP.h
 * @version 1.7
 * @date 2022-11-18
 * @brief Peripheral Access Layer for S32K39_DIGRF_TOP
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K39_DIGRF_TOP_H_)  /* Check if memory map has not been already included */
#define S32K39_DIGRF_TOP_H_

#include "S32K39_COMMON.h"

/* ----------------------------------------------------------------------------
   -- DIGRF_TOP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DIGRF_TOP_Peripheral_Access_Layer DIGRF_TOP Peripheral Access Layer
 * @{
 */

/** DIGRF_TOP - Size of Registers Arrays */
#define DIGRF_TOP_UNSTDR_COUNT                    9u
#define DIGRF_TOP_UNSRDR_COUNT                    9u
#define DIGRF_TOP_GPR_COUNT                       2u

/** DIGRF_TOP - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< LFAST Mode Configuration Register, offset: 0x0 */
  __IO uint32_t SCR;                               /**< LFAST Speed Control Register, offset: 0x4 */
  __IO uint32_t COCR;                              /**< LFAST Correlator Control Register, offset: 0x8 */
  __IO uint32_t TMCR;                              /**< LFAST Test Mode Control Register, offset: 0xC */
  __IO uint32_t ALCR;                              /**< LFAST Auto Loopback Control Register, offset: 0x10 */
  __IO uint32_t RCDCR;                             /**< LFAST Rate Change Delay Control Register, offset: 0x14 */
  __IO uint32_t SLCR;                              /**< LFAST Wakeup Delay Control Register, offset: 0x18 */
  __IO uint32_t ICR;                               /**< LFAST ICLC Control Register, offset: 0x1C */
  __IO uint32_t PICR;                              /**< LFAST Ping Control Register, offset: 0x20 */
  uint8_t RESERVED_0[8];
  __IO uint32_t RFCR;                              /**< LFAST Rx FIFO CTS Control Register, offset: 0x2C */
  __IO uint32_t TIER;                              /**< LFAST Tx Interrupt Enable Register, offset: 0x30 */
  __IO uint32_t RIER;                              /**< LFAST Rx Interrupt Enable Register, offset: 0x34 */
  __IO uint32_t RIIER;                             /**< LFAST Rx ICLC Interrupt Enable Register, offset: 0x38 */
  __IO uint32_t PLLCR;                             /**< LFAST PLL Control Register, offset: 0x3C */
  __IO uint32_t LCR;                               /**< LFAST LVDS Control Register, offset: 0x40 */
  __IO uint32_t UNSTCR;                            /**< LFAST Unsolicited Tx Control Register, offset: 0x44 */
  __IO uint32_t UNSTDR[DIGRF_TOP_UNSTDR_COUNT];    /**< LFAST Unsolicited Tx Data Registers, array offset: 0x48, array step: 0x4 */
  uint8_t RESERVED_1[20];
  __I  uint32_t GSR;                               /**< LFAST Global Status Register, offset: 0x80 */
  __I  uint32_t PISR;                              /**< LFAST Ping Status Register, offset: 0x84 */
  uint8_t RESERVED_2[12];
  __I  uint32_t DFSR;                              /**< LFAST Data Frame Status Register, offset: 0x94 */
  __IO uint32_t TISR;                              /**< LFAST Tx Interrupt Status Register, offset: 0x98 */
  __IO uint32_t RISR;                              /**< LFAST Rx Interrupt Status Register, offset: 0x9C */
  __IO uint32_t RIISR;                             /**< LFAST Rx ICLC Interrupt Status Register, offset: 0xA0 */
  __I  uint32_t PLLLSR;                            /**< LFAST PLL and LVDS Status Register, offset: 0xA4 */
  __IO uint32_t UNSRSR;                            /**< LFAST Unsolicited Rx Status Register, offset: 0xA8 */
  __I  uint32_t UNSRDR[DIGRF_TOP_UNSRDR_COUNT];    /**< LFAST Unsolicited Rx Data Register, array offset: 0xAC, array step: 0x4 */
  uint8_t RESERVED_3[4];
  __IO uint32_t GPR[DIGRF_TOP_GPR_COUNT];          /**< General Purpose registers, array offset: 0xD4, array step: 0x4 */
} DIGRF_TOP_Type, *DIGRF_TOP_MemMapPtr;

/** Number of instances of the DIGRF_TOP module. */
#define DIGRF_TOP_INSTANCE_COUNT                 (1u)

/* DIGRF_TOP - Peripheral instance base addresses */
/** Peripheral DIGRF_TOP base address */
#define IP_DIGRF_TOP_BASE                        (0x404F4000u)
/** Peripheral DIGRF_TOP base pointer */
#define IP_DIGRF_TOP                             ((DIGRF_TOP_Type *)IP_DIGRF_TOP_BASE)
/** Array initializer of DIGRF_TOP peripheral base addresses */
#define IP_DIGRF_TOP_BASE_ADDRS                  { IP_DIGRF_TOP_BASE }
/** Array initializer of DIGRF_TOP peripheral base pointers */
#define IP_DIGRF_TOP_BASE_PTRS                   { IP_DIGRF_TOP }

/* ----------------------------------------------------------------------------
   -- DIGRF_TOP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DIGRF_TOP_Register_Masks DIGRF_TOP Register Masks
 * @{
 */

/*! @name MCR - LFAST Mode Configuration Register */
/*! @{ */

#define DIGRF_TOP_MCR_DATAEN_MASK                (0x1U)
#define DIGRF_TOP_MCR_DATAEN_SHIFT               (0U)
#define DIGRF_TOP_MCR_DATAEN_WIDTH               (1U)
#define DIGRF_TOP_MCR_DATAEN(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_DATAEN_SHIFT)) & DIGRF_TOP_MCR_DATAEN_MASK)

