zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DIGRF_TOP.h
#define DIGRF_TOP_ALCR_LPCNTEN_MASK              (0x10000U)
#define DIGRF_TOP_ALCR_LPCNTEN_SHIFT             (16U)
#define DIGRF_TOP_ALCR_LPCNTEN_WIDTH             (1U)
#define DIGRF_TOP_ALCR_LPCNTEN(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_ALCR_LPCNTEN_SHIFT)) & DIGRF_TOP_ALCR_LPCNTEN_MASK)
/*! @} */

/*! @name RCDCR - LFAST Rate Change Delay Control Register */
/*! @{ */

#define DIGRF_TOP_RCDCR_DRCNT_MASK               (0xF0000U)
#define DIGRF_TOP_RCDCR_DRCNT_SHIFT              (16U)
#define DIGRF_TOP_RCDCR_DRCNT_WIDTH              (4U)
#define DIGRF_TOP_RCDCR_DRCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RCDCR_DRCNT_SHIFT)) & DIGRF_TOP_RCDCR_DRCNT_MASK)
/*! @} */

/*! @name SLCR - LFAST Wakeup Delay Control Register */
/*! @{ */

#define DIGRF_TOP_SLCR_LWKCNT_MASK               (0xFU)
#define DIGRF_TOP_SLCR_LWKCNT_SHIFT              (0U)
#define DIGRF_TOP_SLCR_LWKCNT_WIDTH              (4U)
#define DIGRF_TOP_SLCR_LWKCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_SLCR_LWKCNT_SHIFT)) & DIGRF_TOP_SLCR_LWKCNT_MASK)

#define DIGRF_TOP_SLCR_HWKCNT_MASK               (0xFF00U)
#define DIGRF_TOP_SLCR_HWKCNT_SHIFT              (8U)
#define DIGRF_TOP_SLCR_HWKCNT_WIDTH              (8U)
#define DIGRF_TOP_SLCR_HWKCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_SLCR_HWKCNT_SHIFT)) & DIGRF_TOP_SLCR_HWKCNT_MASK)

#define DIGRF_TOP_SLCR_LSCNT_MASK                (0xF0000U)
#define DIGRF_TOP_SLCR_LSCNT_SHIFT               (16U)
#define DIGRF_TOP_SLCR_LSCNT_WIDTH               (4U)
#define DIGRF_TOP_SLCR_LSCNT(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_SLCR_LSCNT_SHIFT)) & DIGRF_TOP_SLCR_LSCNT_MASK)

#define DIGRF_TOP_SLCR_HSCNT_MASK                (0xFF000000U)
#define DIGRF_TOP_SLCR_HSCNT_SHIFT               (24U)
#define DIGRF_TOP_SLCR_HSCNT_WIDTH               (8U)
#define DIGRF_TOP_SLCR_HSCNT(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_SLCR_HSCNT_SHIFT)) & DIGRF_TOP_SLCR_HSCNT_MASK)
/*! @} */

/*! @name ICR - LFAST ICLC Control Register */
/*! @{ */

#define DIGRF_TOP_ICR_ICLCPLD_MASK               (0xFFU)
#define DIGRF_TOP_ICR_ICLCPLD_SHIFT              (0U)
#define DIGRF_TOP_ICR_ICLCPLD_WIDTH              (8U)
#define DIGRF_TOP_ICR_ICLCPLD(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_ICR_ICLCPLD_SHIFT)) & DIGRF_TOP_ICR_ICLCPLD_MASK)

#define DIGRF_TOP_ICR_SNDICLC_MASK               (0x10000U)
#define DIGRF_TOP_ICR_SNDICLC_SHIFT              (16U)
#define DIGRF_TOP_ICR_SNDICLC_WIDTH              (1U)
#define DIGRF_TOP_ICR_SNDICLC(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_ICR_SNDICLC_SHIFT)) & DIGRF_TOP_ICR_SNDICLC_MASK)

#define DIGRF_TOP_ICR_ICLCSEQ_MASK               (0x20000U)
#define DIGRF_TOP_ICR_ICLCSEQ_SHIFT              (17U)
#define DIGRF_TOP_ICR_ICLCSEQ_WIDTH              (1U)
#define DIGRF_TOP_ICR_ICLCSEQ(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_ICR_ICLCSEQ_SHIFT)) & DIGRF_TOP_ICR_ICLCSEQ_MASK)
/*! @} */

/*! @name PICR - LFAST Ping Control Register */
/*! @{ */

#define DIGRF_TOP_PICR_PNGPYLD_MASK              (0xFFU)
#define DIGRF_TOP_PICR_PNGPYLD_SHIFT             (0U)
#define DIGRF_TOP_PICR_PNGPYLD_WIDTH             (8U)
#define DIGRF_TOP_PICR_PNGPYLD(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PICR_PNGPYLD_SHIFT)) & DIGRF_TOP_PICR_PNGPYLD_MASK)

#define DIGRF_TOP_PICR_PNGAUTO_MASK              (0x8000U)
#define DIGRF_TOP_PICR_PNGAUTO_SHIFT             (15U)
#define DIGRF_TOP_PICR_PNGAUTO_WIDTH             (1U)
#define DIGRF_TOP_PICR_PNGAUTO(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PICR_PNGAUTO_SHIFT)) & DIGRF_TOP_PICR_PNGAUTO_MASK)

#define DIGRF_TOP_PICR_PNGREQ_MASK               (0x10000U)
#define DIGRF_TOP_PICR_PNGREQ_SHIFT              (16U)
#define DIGRF_TOP_PICR_PNGREQ_WIDTH              (1U)
#define DIGRF_TOP_PICR_PNGREQ(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PICR_PNGREQ_SHIFT)) & DIGRF_TOP_PICR_PNGREQ_MASK)
/*! @} */

/*! @name RFCR - LFAST Rx FIFO CTS Control Register */
/*! @{ */

#define DIGRF_TOP_RFCR_RCTSMN_MASK               (0x3FU)
#define DIGRF_TOP_RFCR_RCTSMN_SHIFT              (0U)
#define DIGRF_TOP_RFCR_RCTSMN_WIDTH              (6U)
#define DIGRF_TOP_RFCR_RCTSMN(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RFCR_RCTSMN_SHIFT)) & DIGRF_TOP_RFCR_RCTSMN_MASK)

#define DIGRF_TOP_RFCR_RCTSMX_MASK               (0x3F0000U)
#define DIGRF_TOP_RFCR_RCTSMX_SHIFT              (16U)
#define DIGRF_TOP_RFCR_RCTSMX_WIDTH              (6U)
#define DIGRF_TOP_RFCR_RCTSMX(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RFCR_RCTSMX_SHIFT)) & DIGRF_TOP_RFCR_RCTSMX_MASK)
/*! @} */

/*! @name TIER - LFAST Tx Interrupt Enable Register */
/*! @{ */

#define DIGRF_TOP_TIER_TXDTIE_MASK               (0x1U)
#define DIGRF_TOP_TIER_TXDTIE_SHIFT              (0U)
#define DIGRF_TOP_TIER_TXDTIE_WIDTH              (1U)
#define DIGRF_TOP_TIER_TXDTIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TIER_TXDTIE_SHIFT)) & DIGRF_TOP_TIER_TXDTIE_MASK)

#define DIGRF_TOP_TIER_TXICLCIE_MASK             (0x2U)
#define DIGRF_TOP_TIER_TXICLCIE_SHIFT            (1U)
#define DIGRF_TOP_TIER_TXICLCIE_WIDTH            (1U)
#define DIGRF_TOP_TIER_TXICLCIE(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TIER_TXICLCIE_SHIFT)) & DIGRF_TOP_TIER_TXICLCIE_MASK)

#define DIGRF_TOP_TIER_TXUNSIE_MASK              (0x4U)
#define DIGRF_TOP_TIER_TXUNSIE_SHIFT             (2U)
#define DIGRF_TOP_TIER_TXUNSIE_WIDTH             (1U)
#define DIGRF_TOP_TIER_TXUNSIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TIER_TXUNSIE_SHIFT)) & DIGRF_TOP_TIER_TXUNSIE_MASK)

#define DIGRF_TOP_TIER_TXPNGIE_MASK              (0x10U)
#define DIGRF_TOP_TIER_TXPNGIE_SHIFT             (4U)
#define DIGRF_TOP_TIER_TXPNGIE_WIDTH             (1U)
#define DIGRF_TOP_TIER_TXPNGIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TIER_TXPNGIE_SHIFT)) & DIGRF_TOP_TIER_TXPNGIE_MASK)

#define DIGRF_TOP_TIER_TXOVIE_MASK               (0x10000U)
#define DIGRF_TOP_TIER_TXOVIE_SHIFT              (16U)
#define DIGRF_TOP_TIER_TXOVIE_WIDTH              (1U)
#define DIGRF_TOP_TIER_TXOVIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TIER_TXOVIE_SHIFT)) & DIGRF_TOP_TIER_TXOVIE_MASK)

