zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DIGRF_TOP.h
#define DIGRF_TOP_LCR_SWSLPLD_MASK               (0x400000U)
#define DIGRF_TOP_LCR_SWSLPLD_SHIFT              (22U)
#define DIGRF_TOP_LCR_SWSLPLD_WIDTH              (1U)
#define DIGRF_TOP_LCR_SWSLPLD(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWSLPLD_SHIFT)) & DIGRF_TOP_LCR_SWSLPLD_MASK)

#define DIGRF_TOP_LCR_SWWKLD_MASK                (0x800000U)
#define DIGRF_TOP_LCR_SWWKLD_SHIFT               (23U)
#define DIGRF_TOP_LCR_SWWKLD_WIDTH               (1U)
#define DIGRF_TOP_LCR_SWWKLD(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWWKLD_SHIFT)) & DIGRF_TOP_LCR_SWWKLD_MASK)
/*! @} */

/*! @name UNSTCR - LFAST Unsolicited Tx Control Register */
/*! @{ */

#define DIGRF_TOP_UNSTCR_UNSHDR_MASK             (0x7FU)
#define DIGRF_TOP_UNSTCR_UNSHDR_SHIFT            (0U)
#define DIGRF_TOP_UNSTCR_UNSHDR_WIDTH            (7U)
#define DIGRF_TOP_UNSTCR_UNSHDR(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_UNSTCR_UNSHDR_SHIFT)) & DIGRF_TOP_UNSTCR_UNSHDR_MASK)

#define DIGRF_TOP_UNSTCR_USNDRQ_MASK             (0x10000U)
#define DIGRF_TOP_UNSTCR_USNDRQ_SHIFT            (16U)
#define DIGRF_TOP_UNSTCR_USNDRQ_WIDTH            (1U)
#define DIGRF_TOP_UNSTCR_USNDRQ(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_UNSTCR_USNDRQ_SHIFT)) & DIGRF_TOP_UNSTCR_USNDRQ_MASK)
/*! @} */

/*! @name UNSTDR - LFAST Unsolicited Tx Data Registers */
/*! @{ */

#define DIGRF_TOP_UNSTDR_UNTXD_MASK              (0xFFFFFFFFU)
#define DIGRF_TOP_UNSTDR_UNTXD_SHIFT             (0U)
#define DIGRF_TOP_UNSTDR_UNTXD_WIDTH             (32U)
#define DIGRF_TOP_UNSTDR_UNTXD(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_UNSTDR_UNTXD_SHIFT)) & DIGRF_TOP_UNSTDR_UNTXD_MASK)
/*! @} */

/*! @name GSR - LFAST Global Status Register */
/*! @{ */

#define DIGRF_TOP_GSR_LPCSDV_MASK                (0x1U)
#define DIGRF_TOP_GSR_LPCSDV_SHIFT               (0U)
#define DIGRF_TOP_GSR_LPCSDV_WIDTH               (1U)
#define DIGRF_TOP_GSR_LPCSDV(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_LPCSDV_SHIFT)) & DIGRF_TOP_GSR_LPCSDV_MASK)

#define DIGRF_TOP_GSR_LPCHDV_MASK                (0x2U)
#define DIGRF_TOP_GSR_LPCHDV_SHIFT               (1U)
#define DIGRF_TOP_GSR_LPCHDV_WIDTH               (1U)
#define DIGRF_TOP_GSR_LPCHDV(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_LPCHDV_SHIFT)) & DIGRF_TOP_GSR_LPCHDV_MASK)

#define DIGRF_TOP_GSR_LPCPDV_MASK                (0x4U)
#define DIGRF_TOP_GSR_LPCPDV_SHIFT               (2U)
#define DIGRF_TOP_GSR_LPCPDV_WIDTH               (1U)
#define DIGRF_TOP_GSR_LPCPDV(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_LPCPDV_SHIFT)) & DIGRF_TOP_GSR_LPCPDV_MASK)

#define DIGRF_TOP_GSR_LPFPDV_MASK                (0x8U)
#define DIGRF_TOP_GSR_LPFPDV_SHIFT               (3U)
#define DIGRF_TOP_GSR_LPFPDV_WIDTH               (1U)
#define DIGRF_TOP_GSR_LPFPDV(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_LPFPDV_SHIFT)) & DIGRF_TOP_GSR_LPFPDV_MASK)

#define DIGRF_TOP_GSR_LPTXDN_MASK                (0x10U)
#define DIGRF_TOP_GSR_LPTXDN_SHIFT               (4U)
#define DIGRF_TOP_GSR_LPTXDN_WIDTH               (1U)
#define DIGRF_TOP_GSR_LPTXDN(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_LPTXDN_SHIFT)) & DIGRF_TOP_GSR_LPTXDN_MASK)

#define DIGRF_TOP_GSR_DRSM_MASK                  (0x10000U)
#define DIGRF_TOP_GSR_DRSM_SHIFT                 (16U)
#define DIGRF_TOP_GSR_DRSM_WIDTH                 (1U)
#define DIGRF_TOP_GSR_DRSM(x)                    (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_DRSM_SHIFT)) & DIGRF_TOP_GSR_DRSM_MASK)

#define DIGRF_TOP_GSR_LDSM_MASK                  (0x20000U)
#define DIGRF_TOP_GSR_LDSM_SHIFT                 (17U)
#define DIGRF_TOP_GSR_LDSM_WIDTH                 (1U)
#define DIGRF_TOP_GSR_LDSM(x)                    (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_LDSM_SHIFT)) & DIGRF_TOP_GSR_LDSM_MASK)

#define DIGRF_TOP_GSR_LRMD_MASK                  (0x40000U)
#define DIGRF_TOP_GSR_LRMD_SHIFT                 (18U)
#define DIGRF_TOP_GSR_LRMD_WIDTH                 (1U)
#define DIGRF_TOP_GSR_LRMD(x)                    (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_LRMD_SHIFT)) & DIGRF_TOP_GSR_LRMD_MASK)

#define DIGRF_TOP_GSR_DUALMD_MASK                (0x80000000U)
#define DIGRF_TOP_GSR_DUALMD_SHIFT               (31U)
#define DIGRF_TOP_GSR_DUALMD_WIDTH               (1U)
#define DIGRF_TOP_GSR_DUALMD(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GSR_DUALMD_SHIFT)) & DIGRF_TOP_GSR_DUALMD_MASK)
/*! @} */

/*! @name PISR - LFAST Ping Status Register */
/*! @{ */

#define DIGRF_TOP_PISR_RXPNGD_MASK               (0xFFU)
#define DIGRF_TOP_PISR_RXPNGD_SHIFT              (0U)
#define DIGRF_TOP_PISR_RXPNGD_WIDTH              (8U)
#define DIGRF_TOP_PISR_RXPNGD(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PISR_RXPNGD_SHIFT)) & DIGRF_TOP_PISR_RXPNGD_MASK)
/*! @} */

/*! @name DFSR - LFAST Data Frame Status Register */
/*! @{ */

#define DIGRF_TOP_DFSR_TXFCNT_MASK               (0x7U)
#define DIGRF_TOP_DFSR_TXFCNT_SHIFT              (0U)
#define DIGRF_TOP_DFSR_TXFCNT_WIDTH              (3U)
#define DIGRF_TOP_DFSR_TXFCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_DFSR_TXFCNT_SHIFT)) & DIGRF_TOP_DFSR_TXFCNT_MASK)

#define DIGRF_TOP_DFSR_TXDCNT_MASK               (0x3F00U)
#define DIGRF_TOP_DFSR_TXDCNT_SHIFT              (8U)
#define DIGRF_TOP_DFSR_TXDCNT_WIDTH              (6U)
#define DIGRF_TOP_DFSR_TXDCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_DFSR_TXDCNT_SHIFT)) & DIGRF_TOP_DFSR_TXDCNT_MASK)

#define DIGRF_TOP_DFSR_RXFCNT_MASK               (0x70000U)
#define DIGRF_TOP_DFSR_RXFCNT_SHIFT              (16U)
#define DIGRF_TOP_DFSR_RXFCNT_WIDTH              (3U)
#define DIGRF_TOP_DFSR_RXFCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_DFSR_RXFCNT_SHIFT)) & DIGRF_TOP_DFSR_RXFCNT_MASK)

#define DIGRF_TOP_DFSR_RXDCNT_MASK               (0x3F000000U)
#define DIGRF_TOP_DFSR_RXDCNT_SHIFT              (24U)
#define DIGRF_TOP_DFSR_RXDCNT_WIDTH              (6U)
#define DIGRF_TOP_DFSR_RXDCNT(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_DFSR_RXDCNT_SHIFT)) & DIGRF_TOP_DFSR_RXDCNT_MASK)
/*! @} */

/*! @name TISR - LFAST Tx Interrupt Status Register */
/*! @{ */

#define DIGRF_TOP_TISR_TXDTF_MASK                (0x1U)
#define DIGRF_TOP_TISR_TXDTF_SHIFT               (0U)
#define DIGRF_TOP_TISR_TXDTF_WIDTH               (1U)
#define DIGRF_TOP_TISR_TXDTF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TISR_TXDTF_SHIFT)) & DIGRF_TOP_TISR_TXDTF_MASK)

#define DIGRF_TOP_TISR_TXICLCF_MASK              (0x2U)
#define DIGRF_TOP_TISR_TXICLCF_SHIFT             (1U)
#define DIGRF_TOP_TISR_TXICLCF_WIDTH             (1U)
#define DIGRF_TOP_TISR_TXICLCF(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TISR_TXICLCF_SHIFT)) & DIGRF_TOP_TISR_TXICLCF_MASK)

#define DIGRF_TOP_TISR_TXUNSF_MASK               (0x4U)
#define DIGRF_TOP_TISR_TXUNSF_SHIFT              (2U)
#define DIGRF_TOP_TISR_TXUNSF_WIDTH              (1U)
#define DIGRF_TOP_TISR_TXUNSF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TISR_TXUNSF_SHIFT)) & DIGRF_TOP_TISR_TXUNSF_MASK)

#define DIGRF_TOP_TISR_TXPNGF_MASK               (0x10U)
#define DIGRF_TOP_TISR_TXPNGF_SHIFT              (4U)
#define DIGRF_TOP_TISR_TXPNGF_WIDTH              (1U)
#define DIGRF_TOP_TISR_TXPNGF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TISR_TXPNGF_SHIFT)) & DIGRF_TOP_TISR_TXPNGF_MASK)

#define DIGRF_TOP_TISR_TXOVF_MASK                (0x10000U)
#define DIGRF_TOP_TISR_TXOVF_SHIFT               (16U)
#define DIGRF_TOP_TISR_TXOVF_WIDTH               (1U)
#define DIGRF_TOP_TISR_TXOVF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TISR_TXOVF_SHIFT)) & DIGRF_TOP_TISR_TXOVF_MASK)

#define DIGRF_TOP_TISR_TXIEF_MASK                (0x20000U)
#define DIGRF_TOP_TISR_TXIEF_SHIFT               (17U)
#define DIGRF_TOP_TISR_TXIEF_WIDTH               (1U)
#define DIGRF_TOP_TISR_TXIEF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TISR_TXIEF_SHIFT)) & DIGRF_TOP_TISR_TXIEF_MASK)
/*! @} */

